//
//  importfile.swift
//  sampleTableView001
//
//  Created by yuka on 04/11/2017.
//  Copyright © 2017 yuka. All rights reserved.
//

var vc_teaList = ["★ダージリン★","★アールグレイ★","★アッサム★","★オレンジペコ★"]


var teaExplainList = [
    /*ダージリン*/ "アッサムの実父。ゴパルダーラの遠縁。禁忌の紅茶王子であり、セイロンの父・ディンブーラによって長年封印されていたが、彼が他界した隙をついて脱出する。その時に偶然にも奈子の父・健児に呼び出され、奈子の叔父でもある彼の異母弟・玲一の記憶等を拝借して成りすましていた。奈子の初恋の相手。紅茶の国に帰還するまで「ダージリン」と名付けられた黒猫を飼っていた。主人殺しの咎人とされたが、実際はそうした事実は無くて人間の世界に奪われまいとしたゴパルダーラの捏造だった。一度も我が子と呼ぶことの無かった最愛の息子アッサムと入れ替わりに紅茶の世界に戻り、表向きはスリランカに行くということにして日本（人間界）を去った。アッサムが人間になる代償として息子の存在を忘れてしまう。身長180cm、体重70kg。"
    /*アールグレイ*/,"人間界では「アールグレイ・プリンストン」と名乗る。ふわふわの金の巻き毛と緑の瞳であり、提灯ブルマーのいわゆる王子様ファッション。オレンジペコーの兄。同腹の妹はペコーだけだが、腹違いの兄弟・姉妹は人数を把握できないくらい大勢いる。アッサムには「アル」と呼ばれる。酒に弱い上に酒癖が悪く、まるで酒乱の見本市。身長175cm、体重53kg。"
    /*アッサム*/,"人間の母アリヤと紅茶王子の父ゴパルダーラを持つハーフ。実は、禁忌の紅茶王子ダージリンの息子。実父ダージリンは白人男性のような容姿だが、ゴパルダーラの遠縁ゆえに養父によく似た色彩と容貌で強い黒髪の癖っ毛と褐色の肌。王子様ファッションはトルコ風。       身長182cm、体重75kg。趣味・特技は家事全般。よく食べる。"
    /*オレンジペコ*/,"アールグレイの妹。通常はペコーで通っており、幼馴染のアッサムからはピィと呼ばれる。アッサムの許婚だったが、後に王達により婚約を解消され新たな許婚にセイロンを定められた。語尾に「〜ですわ」などを付けるお姫様らしい話し方をするが、アッサムの口調が移ってしまい怒ると少し言葉使いが荒くなる。奈子達の高校の生徒会長・菊花に偶然にも呼び出された。2月の雹混じりの雨の被害に遭った温室を元に戻すことを最後の願い事として叶え、菊花と別れた。お祭りが大好き。最終話直前、セイロンの主人となる熊笹と一緒におまじないをした菊花の妹・皐月に召喚された。人間換算年齢16歳。"
    
]

var teaImage = [
    /*ダージリン*/ "tabunDarjeeling.png"
    /*アールグレイ*/,"earlgrey.jpg"
    /*アッサム*/,"assam.gif"
    /*オレンジペコ*/,"orangepeko.jpg"
    
]
